#language: ru

@tree
@smoke
@readonly

Функционал: Дымовой тест реестра баз (только чтение)
	Как администратор реестра баз
	Я хочу знать, что список реестра открывается с данными
	Чтобы поломку расширения РеестрБазФикс увидеть раньше пользователей

Контекст:
	Дано Я открыл новый сеанс TestClient или подключил уже существующий

Сценарий: Список реестра баз открывается с кнопками РеестрБазФикс
	# Кнопки рбф* создаёт расширение в &После("ПриОткрытии"). Их нет, значит набор расширений не применился.
	И я закрываю все окна клиентского приложения
	И я открываю навигационную ссылку "e1cib/list/РегистрСведений.СерверыИБазы"
	Тогда открылось окно "Серверы и базы"
	И элемент формы с именем "рбфКнопкаВернутьБазу" присутствует на форме
	И элемент формы с именем "рбфКнопкаПродлитьСрок" присутствует на форме
	И элемент формы с именем "рбфКнопкаСтатьВладельцем" присутствует на форме
	И я жду, что в таблице "Список" количество строк будет "больше" 0 в течение 20 секунд
	И я закрываю все окна клиентского приложения
